{
  "main": {
    "name": "Roshan Sharma",
    "occupation": "Full Stack Software Developer",
    "description": "ReactJS, Redux, NodeJS, Express, JavaScript",
    "image": "download.jpg",
    "bio": "Passionate Full Stack Software Engineer with more than 4 years of professional experience in developing enterprise products using ReactJS, Redux, NodeJS, Express, JavaScript, SQL, MongoDB, Material UI, Bootstrap, HTML5, CSS3.",
    "contactmessage": "Get in touch with me to receive further details.",
    "email": "roshansharma406@gmail.com",
    "phone": "+91 9766084483",
    "address": {
      "street": "Sneha Vihar,",
      "city": "Pune",
      "state": "Maharashtra",
      "zip": "411023"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload": "https://drive.google.com/file/d/10EPg4af5XsJViLCck_40KcwY4vhPJuAb/view?usp=sharing",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/roshan406",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/ross406",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/ross_truegamer",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/ross406",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here you can see my skills.",
    "education": [
      {
        "school": "Sinhgad Institute of Management, Pune",
        "degree": "Master of Computer Application (MCA)",
        "graduated": "April 2023",
        "description": "First Class with Distinction - Grade 76.8% "
      },
      {
        "school": "Modern College of Arts, Science and Commerce, Pune",
        "degree": "Bachelor of Business Administration (BBA)",
        "graduated": "April 2021",
        "description": "First Class with Distinction - Grade 77.7% "
      }
    ],
    "work": [
      {
        "company": "Tecnotree",
        "title": "Lead Developer",
        "years": "From May 2024",
        "description": "Led the design and development of a Bill Layout Designer using React, incorporating the react-dnd library for intuitive drag-and-drop functionality. Developed a Config-Driven UI using JSON schema to dynamically define and manage widgets and styles. Implemented a Socket.IO connection in Node.js to enable real-time saving of templates. Improved application performance by reducing execution time by 80% through the implementation of Memoization, significantly optimizing data processing and rendering."
      },
      {
        "company": "Team Geek Solutions",
        "title": "Software Engineer",
        "years": "Dec 2021 - May 2024",
        "description": " Developed and deployed a Discord Bot to facilitate matchmaking between players and manage dynamic teams for the Pittsburgh Knights (US based client), enhancing user engagement and team coordination. Designed and maintained NestJS microservices with seamless communication via NATS, integrated Redis caching to optimize performance and reduce response times. Utilizing DrizzleORM with PostgreSQL for efficient database management, ensuring a robust, scalable backend architecture. Built an AdminPanelusingNext.js, leveraging server and client components to deliver a dynamic, high-performance user interface for better administrative control and user experience"
      },
      {
        "company": "LitmusBlox",
        "title": "Software Engineer",
        "years": "Nov 2020 - Dec 2021",
        "description": "LitmusBlox is an AI-powered platform that enables hiring managers to define jobs and helps the talent team to identify right-fit candidates exactly matching the job requirement. Worked as a Full Stack Software Developer and was responsible for developing modules assigned. Responsible for developing ReactJS client. Responsible for developing REST APIs with Node and Express. Designing and developing automation solutions for data extraction from the web with ReactJS. "},
      {
        "company": "Broadway Society",
        "title": "Software Engineer - Intern",
        "years": "April 2020 - July 2020",
        "description": "Worked on a Movie reviews website a MERN stack Project. Worked as a Full Stack Software Developer. Worked on the Front End of the website which is built using React.js. Worked on the Back End of the website which is built using Node.js and Express. Managed MongoDB web database. Deployed the website on Heroku. "
      }
    ],
    "skills": [
      {
        "name": "ReactJs",
        "level": "95%",
        "logo": "react.png"
      },
      {
        "name": "Redux",
        "level": "95%",
        "logo": "redux.png"
      },
      {
        "name": "NodeJs",
        "level": "80%",
        "logo": "node.png"
      },
      {
        "name": "MongoDB",
        "level": "80%",
        "logo": "mongodb.png"
      },
      {
        "name": "CSS",
        "level": "70%",
        "logo": "css3.png"
      },
      {
        "name": "HTML5",
        "level": "70%",
        "logo": "HTML5.png"
      },
      {
        "name": "Git",
        "level": "70%",
        "logo": "git.png"
      }
    ]
  },
  "portfolio": {
    "oldProjects":[
      {
        "title": "Netflix Clone",
        "category": "Netflix Clone built with ReactJS",
        "image": "netflix-clone.jpeg",
        "url": "https://netflix-clone-9762a.firebaseapp.com/"
      },
      {
        "title": "COVID-19 Tracker",
        "category": "COVID-19 Tracker built with ReactJS",
        "image": "covid.png",
        "url": "https://covid-19-tracker-26dce.web.app/"
      },
      {
        "title": "Finjo Flow Builder",
        "category": "Finjo Flow Builder built with React (TypeScript)",
        "image": "flow.png",
        "url": "https://talentflow-dev.finjo.io/"
      },
    ],
    "projects": [
      {
        "title": "ProShop",
        "category": "E-commerce website built with MERN",
        "image": "proshop.png",
        "url": "https://proshop-fe.netlify.app/"
      },
      {
        "title": "EchoTube",
        "category": "Video streaming site with YouTube API integration",
        "image": "echotube.png",
        "url": "https://echotube-fe.netlify.app/"
      },
      {
        "title": "Food Studio",
        "category": "Food Delivery App Developed with React and Parcel Bundler",
        "image": "foodstudio.png",
        "url": "https://foodstudio-fe.netlify.app/"
      },
      {
        "title": "Netflix With GPT",
        "category": "Netflix Clone built with ReactJS and Chat GPT API",
        "image": "netflix-clone.jpeg",
        "url": "https://netflwithgpt.netlify.app/"
      },
      {
        "title": "Amazon Clone",
        "category": "Amazon Clone built with ReactJS",
        "image": "dims.jpg",
        "url": "https://clone-2a6eb.firebaseapp.com/"
      },
      {
        "title": "Discord Clone",
        "category": "Discord Clone built with ReactJS",
        "image": "discord.webp",
        "url": "https://discord-clone-4300c.web.app/"
      }     
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "It is with much pleasure that I take this opportunity to write a personal recommendation for Roshan Sharma. He has been a crucial member of the web development team of Broadway Society and was working as a Full Stack Developer since he joined us on 04th April 2020 till 04th July 2020.      His task was to design and build our website - www.broadwaysociety.in , which he successfully did, and the organisation is really proud of him. Over his term of 100+ days at the organisation he has had diverse responsibilities, as a web developer. Being a Web Developer can be irritating at times, but for Roshan, it is something he loves, and puts all his time, effort and energy into. He worked both on the Front End and the Back End of the website. He has been regularly up to date with all the tasks assigned to him and has continuously provided the organisation with extremely high-quality work. Roshan carries his duties with due diligence and enthusiasm thus giving out his best. He is very focused and eyeing to make a name for himself in this field. He is an outgoing student of good character and a team builder. I have found him to be an individual of great commitment and focus, duly possessing exceptional logical thinking skills as manifested in his performance towards the duties and responsibilities. He is a dedicated individual and works with extreme professionalism. I can therefore recommend him to any place that he wants to go for. With my knowledge, I know he has the necessary skills and expertise to perform the duties assigned to him timely. I am confident he will apply the same enthusiasm in any institution where he is a part of. Having Roshan in your institution is more of an asset.",
        "user": "Aayush Kumar Jha Founder and Director Broadway Society"
      },
      {
        "text": "I have had the privilege of working with Roshan for the a year at Litmusblox as a full-stack software engineer. During this time, I have been thoroughly impressed with his technical abilities, leadership skills, and overall dedication to his work. Roshan has been instrumental in the success of our projects at Litmusblox Additionally, Roshan has been a valuable mentor to the team of interns and has effectively guided them in their professional development. I am confident that Roshan would be an asset to any organization",
        "user": "Suraj Wadje colleague from Broadway Society and LitmusBlox"
      },
      {
        "text": "I had the pleasure of working with Roshan for few years and I highly recommend him for any professional opportunity. Roshan is an exceptional individual who brings a unique combination of technical expertise and outstanding interpersonal skills to any project. During our time together, Roshan consistently demonstrated his ability to think creatively and solve complex problems in a fast-paced environment. He has a strong work ethic and always goes the extra mile to ensure that the project is completed to the highest standard. His ability to effectively communicate and collaborate with team members, stakeholders and clients has been a major factor in our success. Roshan has a passion for learning and growth, and is constantly seeking new opportunities to expand his knowledge and skills. He is a true team player and always brings a positive attitude and energy to the workplace. I have no doubt that Roshan will excel in any role he takes on, and I highly recommend him to anyone looking for a top-performing professional. Best regards, Sumit Mullur",
        "user": "Sumit Mullur worked with me but we were at different companies"
      }
    ]
  }
}
